{
    "Title": "***PRICE DROP*** Well-Established Indoor Kids Playground",
    "Location": "Plympton, MA (Plymouth County)",
    "Country": "USA",
    "Asking Price": "$1,200,000",
    "Cash Flow": "$250,000",
    "Gross Revenue": "$1,552,408",
    "EBITDA": "$350,000",
    "FF&E": "$500,000",
    "Inventory": "N/A",
    "Rent": "$30,000 per Month",
    "Established": "2018",
    "Business Description": "Off the Wall Kidz introduces a much needed and highly requested style of indoor family entertainment to New England. There are so few play spaces in this area, and even fewer with an original design, family built feel and commitment to service and experience. Designed for children ages 1-11, this space is made up of an expansive two story play structure, interactive games, dedicated toddler area, pretend city style buildings, miniature bowling, age appropriate arcade games and more. Off the Wall Kidz has become a top spot for hosting Birthday Parties and welcomes over 1,000 booked events a year. Truly a gem of a community that will boast many years of success.Ad#:2241409",
    "Business Website": "https://www.offthewallkidz.com/",
    "Detailed Information": {
        "Location": "Plympton, MA",
        "Inventory": "Included in asking price",
        "Real Estate": "Leased",
        "Building SF": "25,000",
        "Lease Expiration": "5/1/2029",
        "Employees": "20",
        "Furniture, Fixtures, & Equipment (FF&E)": "Included in asking price",
        "Facilities": "Carver, MA: Built in 2018\r\nNorth Hampton, NH: Built in 2021\r\nFRONT: Office Furnishings, Hardware, Guest Storage and seating\r\nMIDDLE: 4,500 sqft (MA) and 3,500 sqft (NH) two story play structures, pretend city buildings, miniature bowling (MA), Ball Blaster (NH), toddler area soft play, cafe tables, seating, Party Room furnishings, built in cabinetry\r\nBACK: Kitchen equipment, storage units, tools and equipment",
        "Competition": "Both Off the Wall Kidz locations are in smaller communities surrounded by larger cities and towns that funnel in repeated daily consumers as well as tourists to nearby areas (Plymouth, MA and Hampton Beach, NH). There are a few competitors nearby but none include our same features or dedication to cleanliness and service as seen by reviews. The market has bounced back completely after Covid and we find families will do without other luxuries and still prioritize children's celebrations and entertainment.",
        "Growth & Expansion": "There are many opportunities for growth and expansion with this brand. We frequently receive requests from additional cities to open a location near them. We added North Hampton in our third year of business. The list is mostly in the pro column as the brand is well rated and will do well in communities lacking this specific type of entertainment.",
        "Financing": "We have relationships with multiple SBA lenders. Customers must have good credit",
        "Support & Training": "In our hopes to expand our secondary brand of business, we must relinquish Off the Wall Kidz but do so with hesitation and hold it in high regard. We will work effortlessly to assist new ownership with a smooth transition by providing a 30 day training period on daily operations, procedures, vendors, financials, community details, equipment maintenance and more.",
        "Business Website": "https://www.offthewallkidz.com/"
    }
}